Enums/ВидыСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыСкладов</Name>
			<Comment>Виды складов(Обычный, Ордерный, Ордерный и ячеистый)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обычный</Name>
					<Comment>Обычный склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ордерный</Name>
					<Comment>Ордерный  склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОрдерныйЯчеистый</Name>
					<Comment>Ордерный и ячеистый склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ячеистый</Name>
					<Comment>Ячеистый склад</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыСкладов/Ext/ManagerModule.bsl
// Модуль менеджера документа "Поступление товаров"

#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	// Получим значения функциональных опций
	ИспользоватьОрдерныйСклад  = ПолучитьФункциональнуюОпцию("ИспользоватьОрдерныйСклад");
	ИспользоватьЯчейкиХранения = ПолучитьФункциональнуюОпцию("ИспользоватьЯчейкиХранения");
	
	// Ограничения на список не накладываются
	Если ИспользоватьОрдерныйСклад И ИспользоватьЯчейкиХранения Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = ЛОЖЬ;
	ДанныеВыбора         = Новый СписокЗначений();
	
	Для каждого Значение Из Метаданные.Перечисления.ВидыСкладов.ЗначенияПеречисления Цикл
		
		Если Значение.Имя="Ордерный" И (НЕ ИспользоватьОрдерныйСклад) Тогда
			Продолжить;
		ИначеЕсли Значение.Имя="Ячеистый" И (НЕ ИспользоватьЯчейкиХранения) Тогда
			Продолжить;
		ИначеЕсли Значение.Имя="ОрдерныйЯчеистый" И НЕ (ИспользоватьЯчейкиХранения И ИспользоватьОрдерныйСклад) Тогда
			Продолжить;
		ИначеЕсли ЗначениеЗаполнено(СокрЛП(Параметры.СтрокаПоиска)) И (НЕ СтрНайти(ВРег(Значение.Синоним), ВРег(Параметры.СтрокаПоиска))) Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеВыбора.Добавить(Перечисления.ВидыСкладов[Значение.Имя], Значение.Синоним);
		
	КонецЦикла;
	
КонецПроцедуры // ОбработкаПолученияДанныхВыбора()

#КонецОбласти
